abi
abs
absolute
abspath
accept
acceptability
acceptable
acceptance
accepted
acceptor
accessor
activate
activated
active
adapt
adapter
adaptive
add
added
additional
adjust
adjusted
advice
aff
affine
affinity
after
again
airn
aix
ajcn
akeep
alg
algorithm
algorithmic
alias
aliased
all
alloc
allocate
allocated
allow
alpha
alter
always
alwayszero
amax
ampl
analyse
analysis
analytic
and
andreas
answer
any
anyany
api
app
append
application
applications
apply
approximation
arbitrary
archive
archives
are
arg
arguments
arith
armijo
arnoldi
array
arrowhead
artificial
asl
assemble
assembler
assembly
assets
asum
asymmetric
asymmetry
atag
attach
attempt
attempts
aug
augment
augmented
augsys
augsyssolver
auxiliary
available
avc
avrg
axpy
back
backend
backlog
backslash
backsolve
backsolver
backsolves
backtracking
backup
backward
balancing
banana
bar
barr
barrier
base
based
baseline
basename
basic
basis
benchmark
benchmarks
best
beta
bfgs
biegler
biggest
binaries
bind
binding
bit
blas
block
blocks
blrm
bndry
bob
bool
bootstrap
bord
border
bordered
borrow
borrowed
borrownlpp
bound
boundary
boundcheck
bounded
bounds
breakdown
bridge
buffer
buffers
build
builder
builds
cache
cached
caches
calc
calculate
calculated
calculator
call
callable
callback
callbacks
called
caller
callgr
callgrind
calls
can
canary
cand
candidate
canonical
capabilities
capability
car
carl
case
cases
catalog
categories
category
cauchy
cause
cdminuss
centrality
certainty
certificate
certification
certified
certify
cgfast
cgpen
change
changed
changes
changing
channels
check
checked
checker
checksum
chi
cholesky
chter
clean
cleanup
clear
clobber
clone
cmd
cmds
cnf
cnt
cntl
cntrl
coarse
code
codes
coefficients
coin
coinbrew
coinor
col
collection
colors
cols
column
columns
command
commit
committed
comp
compare
comparison
compatible
compile
compl
complement
complementarity
completed
compose
composition
compound
compressed
comps
compute
con
condensation
condense
condition
conditions
config
configall
configurability
configuration
configure
configured
congruence
congruent
cons
consider
const
constr
constraint
constraints
constructions
constructor
cont
container
contiguous
continue
continuous
continuously
contract
contribution
control
controller
controls
conv
conval
converged
convergence
convert
converter
coordinate
coordinates
cops
copy
copyright
core
corpus
corr
correct
correction
corrections
corrector
cosines
count
counter
counters
counting
coupling
cpp
cppcheck
cpu
create
creations
cross
csr
cstd
cstr
ctol
cup
curr
current
curv
custom
cut
cutest
cwrapperexe
cxx
cycle
cycles
cygming
cygpath
cygwin
damping
dash
dasum
data
daxpy
day
dcopy
ddot
debug
dec
decl
decomposition
decr
decrease
def
default
degen
degeneracy
degenerate
delete
delimited
delta
deltas
demand
dense
dep
depcomp
dependencies
dependency
dependent
dependents
depends
depfile
deprecated
deriv
derivative
derivatives
des
desc
description
desired
detach
detached
details
detect
detection
detector
determine
dev
developers
development
dgemm
dgemv
dgetrf
dgetrs
diag
diagonal
diagonals
dieter
difference
differentiability
differentiable
dim
dimension
dimensions
dir
direct
direction
directional
diri
dis
disable
discover
discrete
dispatched
dispose
dist
diverg
diverged
diverging
divide
dll
dlsyms
dnrm
documentation
does
dog
dogleg
dominated
dot
double
doubles
doxygen
dparm
dpotrf
dpotrs
dppsv
driver
dropping
droptol
drs
dscal
dsdp
dsin
dsyev
dsymv
dsyrk
dtoc
dtrsm
dual
duals
dudu
due
dummy
dump
dydu
dydy
dynamic
dynamics
echo
eclipse
eigen
eigendecomp
eigenvalues
eight
element
eliminate
eliminated
elimination
emit
empty
emptynlp
enable
enabled
encoding
end
engineering
enquire
ensure
entire
entries
entry
enum
env
environment
eps
epsilon
equal
equalities
equality
equals
equilibration
erasure
error
errors
est
eta
euclidean
eval
evals
evaluate
evaluation
evaluations
every
evolution
exact
example
exception
excepts
executable
execute
exist
exit
exp
expand
expanded
expansion
expect
expected
experimental
exponent
export
ext
extended
extract
fac
fact
factor
factorization
factorizations
factorize
factorized
factorizestagenumerically
factors
factory
fail
failing
failure
failures
fall
fallback
fallbacks
family
fast
fatal
fatrop
fctidx
feasibility
features
fgmres
fiacco
file
fill
fillin
filter
final
finalise
finalize
find
findiff
fingerprint
finish
finite
fint
first
fix
fixed
fixedvar
fixture
fkeep
flag
flags
flat
flatten
flexible
flow
flowsheets
flush
footer
for
form
format
formulation
forsgren
fortran
forward
four
fourer
fptr
frac
free
frequency
frobenius
from
fromovitz
front
ftype
full
func
function
functions
funding
fused
gamma
ganesh
gate
gates
gauss
gay
gemm
gemv
gen
generate
generated
get
getcurr
getrf
getrs
gill
git
give
givens
global
globalization
gnu
golden
grad
gradient
gram
graph
grep
grid
growth
guarantees
guarded
guess
guts
haltonerror
hand
handler
handling
happy
has
hash
hat
have
head
header
help
helper
hess
hessenberg
hesset
hessian
hessians
hessj
hessstruct
hessvals
hhh
high
hint
history
hock
holds
hook
hookable
hooks
host
how
hpp
hsl
hslloader
html
hub
iamax
icntl
idamax
ident
identical
identity
idx
ifact
ifini
ifs
ift
ignore
iinit
ikeep
impl
implementation
implib
implicit
import
improved
improvement
improvements
inactivate
inactive
inc
incomplete
increase
indef
indented
independence
independent
index
indicators
indices
inequal
inequalities
inequality
inertia
inexact
inf
infeasbounds
infeascons
infeasi
infeasibilities
infeasibility
infeasible
infer
infinity
infix
info
information
init
initial
initialization
initialize
initialized
initializer
initiative
inner
input
inputs
insensitive
install
installation
int
integer
integration
intel
interface
interfaces
interior
intermediate
internal
interrupt
interrupted
into
introduction
introspection
inv
invalid
invalidate
invalidated
inverse
invert
invertstagenumericall
invoke
iparm
ipindex
ipnumber
ipopt
ipoptlib
ipoptr
ipos
irows
istream
iter
iterate
iterates
iteration
iterations
iterative
iters
iwork
jac
jacobi
jacobian
jacobians
java
jboolean
jcols
jelmer
jint
jipopt
jlong
jmethod
jni
jniexport
jnlst
jnumber
jobject
jordan
journal
journalist
journals
jstring
jump
just
kappa
karush
keep
kernighan
keyword
keywords
kind
kkt
kraft
krylov
kuhn
lag
lagrangian
laird
lalib
lam
lambda
language
lapack
large
last
latest
latex
layout
layouts
lazy
lbfgs
least
legacy
leisch
len
lengths
level
levels
lfact
lib
libid
library
libsipopt
libtool
license
lifact
lifecycle
lifetime
lim
limit
limited
limits
line
linear
linearity
linearized
lines
linesearch
link
linsolver
list
live
liw
lkeep
lmsr
load
loader
loading
local
locale
log
logs
loop
loqo
low
lower
lowrank
ltmain
ltwrapper
luksan
machine
magic
main
make
makeconstr
mangasarian
manual
many
map
maps
margin
mark
match
matching
materialized
matrices
matrix
max
maxfct
maxfrt
maximize
maximum
means
measure
measurement
mechanism
median
mem
members
meminc
memory
message
meta
metadata
method
methods
microseconds
min
minimum
minus
miscellaneous
mismatch
mismatching
missing
mittelmann
mkdir
mkl
mktempdir
mnum
mode
model
modeling
models
modify
monotone
msc
msglvl
msys
mtype
mult
multi
multiple
multiplier
multipliers
multiply
multiplying
mults
mumps
munge
must
nabla
name
namespace
nanoseconds
native
ncols
ndim
near
neg
negative
negevals
negrete
nele
nelt
nerror
neum
never
new
newton
next
nfixed
nix
nlp
nmpcresults
nocedal
nodes
nominal
non
nonfinite
nonlinear
nonmonotone
nonzeros
noop
norm
normal
normalization
normalize
normalized
not
notification
notify
notquiet
nrm
nrows
nsteps
null
num
number
numbers
numdelay
numeric
numerical
numerically
numerics
numneg
nvars
obj
object
objective
objects
objval
observer
ocp
off
offset
offsets
old
omega
once
one
only
open
operation
operator
opt
optimal
optimality
optimization
optimize
option
optional
options
oracle
order
ordering
org
orig
original
origipoptnlp
orthogonal
orthogonality
ostream
outcome
output
outputs
over
overhead
overlap
overlaps
override
overview
overwrite
owned
owner
ownership
owning
pack
package
packed
pair
pairs
paper
para
parallel
parameter
parameters
parametric
pardiso
pardisoinit
pardisoloader
parse
partial
partition
party
pat
path
pathsep
pcalc
pde
pderror
pdfullspacesolver
pdpert
pdsystemsolver
pen
penalty
per
percent
perform
performance
permutation
permuting
pert
perturb
perturbation
perturbations
perturbed
perturber
pez
pfgh
phase
phi
physical
piece
piecewise
piecewisepenalty
pipeline
pirnay
pivot
pivoted
pivoting
pivots
pivtol
pivtolmax
place
plan
platform
plot
plus
point
pointer
pointers
policy
portable
pos
posdef
positions
positive
post
postprocess
potrf
potrs
power
ppsv
pre
precision
precompiled
preconditioned
preconditioner
pred
prefix
preinstalled
prep
preparation
prepare
prepared
preserve
presolve
previous
pri
primal
primals
print
printf
printiterate
priority
probing
problem
problems
process
produce
product
products
profile
prog
program
programming
progress
progs
project
projected
projects
proof
propagate
protected
protocol
prototype
provided
provider
provides
psi
ptr
public
pure
push
put
quadratic
qualification
quality
quantities
quasi
query
quote
quoted
quotefast
quotient
radius
random
rank
ratio
raw
reach
read
readme
readnexttoken
reals
reason
recalc
receive
reciprocal
reconstruct
reconstructed
reconstruction
record
recording
recursive
red
redhess
redo
reduced
reducer
reduction
ref
refactorize
reference
referenced
referencer
refined
refinement
refs
reg
register
registered
registering
regression
regularization
reimplementation
rejected
rejection
rejections
relative
relax
relaxed
release
remaining
remember
removable
remove
remover
reoptimizetnlp
reorder
reordering
reorthogonalize
repeated
replace
replaceme
replacement
replacements
report
reported
request
requests
require
required
requirement
requires
rescale
research
reset
resets
resid
residual
residuals
resize
resolve
resolved
resort
restart
restarted
resto
restor
restoration
restorations
restore
restored
result
results
retains
retries
retry
return
reus
reusable
reuse
reuses
reverse
revision
rho
rhs
right
rigorous
rinfo
rnlp
robustness
rosenbrock
rotate
rotations
row
rows
run
runtime
safe
safeguard
same
sample
samples
saturating
scal
scalable
scalar
scale
scaled
scales
scaling
scatter
scenario
schittkowski
schittkowsky
schur
scope
scopes
scratch
script
scriptname
sdot
search
second
section
sed
select
sens
sensitivity
separation
sequential
session
set
setipoptcallbackfunction
setting
sexp
sgn
shared
shift
short
shortened
shortest
should
show
side
sides
sighandler
sigma
simple
sines
single
singular
singularity
sinv
sipopt
size
sizes
skip
skipped
skipping
slack
slacks
sma
small
smart
smat
smoke
snapshot
snprintf
soc
soft
sol
solution
solutions
solv
solve
solved
solver
solvers
solves
sort
source
sources
space
spaces
span
sparse
sparseness
sparsity
special
split
sponsors
spral
sqrt
square
src
sta
stability
stable
stage
stages
stale
standard
start
started
starting
state
states
static
statistics
status
std
stdaugsystemsolver
stdrs
stefan
step
steps
stop
storage
store
str
strat
strategy
stream
strict
string
stringstream
stripname
strong
struc
struct
structural
structure
structured
structures
student
studio
style
subject
subtract
successful
successive
suf
sufficient
suffix
suffixes
suite
sum
summarize
sumsym
suncc
superlinear
support
supported
swap
sweave
sweeps
switch
switched
syev
sym
symbol
symbolic
symmetric
symmetricblocktr
symmetrize
symmetry
symv
syrk
sys
sysroot
system
tag
tagged
tags
tangential
target
targets
task
tasks
tau
tcc
template
term
termination
terms
test
tester
testing
tests
text
the
theorem
theta
third
this
threads
three
threshold
through
throw
tilde
time
timed
times
timing
tiny
title
tmp
tnl
tnlp
tnlpadapter
tol
tolerance
tool
toolbox
topologies
topology
total
trans
transactional
transformation
transformations
transforms
transpose
transposed
travis
treatment
treatments
tri
trial
triangle
tridiagonal
trigger
triplet
triplets
trsm
true
try
tsym
tsymli
tucker
tutorial
twice
two
twosided
type
types
uint
umax
unapply
uncached
uncertified
uninitialized
uninstall
uniq
unique
unload
unpack
unregister
unregularized
unsafe
unscale
unscaled
unset
unsupported
unused
update
updater
updates
upper
uptodate
usage
use
used
user
using
utilde
utils
val
valid
validate
validated
validation
validcomple
vals
value
values
vanderbei
var
variable
variables
variant
variants
vars
vartheta
vec
vecs
vecspace
vector
vectors
ver
verbose
version
versioning
veyor
via
view
views
vigerske
viol
violation
violations
visual
vlcek
vtilde
waechter
wall
wallclock
warm
warn
warning
watch
watchdog
watson
wdiag
what
where
which
will
win
windows
wine
wise
with
word
work
workflow
workspace
wrapper
wright
write
written
wrong
wsmp
xform
ypart
ypma
ytol
zero
zeros
zeta
активного
аппликация
асимметрию
без
безопасно
блоков
был
быть
валидации
валидны
владеет
вместо
вокруг
всего
встроить
вызывают
где
данный
дать
для
доказанный
должен
должны
его
живые
запрос
изменение
изменения
изменился
изучи
или
ими
инварианты
инициализацией
исключить
используя
как
какие
какой
когда
копированием
копию
кто
кэшей
ленивой
ломая
матричная
мог
модификации
можно
направления
нарушения
независимый
нескольких
новый
нормализованного
нормализованном
нужен
обнулени
обнуление
ограничения
они
определяют
ослабив
ослабляя
основной
первом
перед
переиспользовать
переписывать
перфоманс
повторном
повторную
повторные
подтвердили
политики
полного
попутно
порядок
после
потери
почему
предварительное
преобразования
преобразуют
при
проверки
прогоне
проходит
проходы
пулл
пут
пути
путь
работу
разбиение
реализовать
реквесты
реконструкцией
робастность
связанность
семантики
следующий
слить
создаёт
сократить
солвер
сох
сохранены
сохранив
сохранять
сравнивать
становятся
строятся
сумм
также
текущий
только
тонкий
транзакционности
транзакционность
убрать
улучшая
ускорена
ускорить
ускоряет
ускорять
успешной
устойчивости
устранимый
факторизацию
финальный
форки
хочу
чер
через
честно
численную
экспортировать
явный